KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/MCan/Inc/Reg_eSys_MCan.h
/**
*   @file    Reg_eSys_MCan.h
*   @version 1.0.1
*
*   @brief   AUTOSAR MCan - MPC560xB FlexCan Registers and Macros Definitions.
*   @details Header file for MPC560xB FlexCan Registers and Macros Definitions.
*
*   @addtogroup CAN_DRIVER
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : MCAN
*   Dependencies         : 
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC5777C_MCAL_1_0_1_RTM_HF1_ASR_REL_4_0_REV_0003_20170606
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/


#ifndef REG_ESYS_MCAN_H
#define REG_ESYS_MCAN_H

#ifdef __cplusplus
extern "C" {
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely 
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
* @section Reg_eSys_MCan_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section Reg_eSys_MCan_h_REF_2
* Violates MISRA 2004 Required Rule 8.10, external ... could be made static
* The respective code could not be made static because of layers architecture design of the driver.
*
* @section [global]
* Violates MISRA 2004 Required Rule 1.4, The compiler/linker shall be checked to ensure
* that 31 character significance and case sensitivity are supported for external identifiers.
* The defines are validated.
*
* @section Reg_eSys_MCan_h_REF_4
* Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
* There are different kinds of execution code sections.
*
*/


/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"


/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @{
* @brief Internal micro-dependent versioning.
*/
#define CAN_VENDOR_ID_REGM                    43
#define CAN_MODULE_ID_REGM                    80
#define CAN_AR_RELEASE_MAJOR_VERSION_REGM     4
#define CAN_AR_RELEASE_MINOR_VERSION_REGM     0
#define CAN_AR_RELEASE_REVISION_VERSION_REGM  3
#define CAN_SW_MAJOR_VERSION_REGM             1
#define CAN_SW_MINOR_VERSION_REGM             0
#define CAN_SW_PATCH_VERSION_REGM             1
/**@}*/

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/
#ifdef  MCAN1_BASEADDR
        #define MCAN1_AVAILABLE    1U
#else    
        #define MCAN1_AVAILABLE    0U    
#endif /* MCAN1_AVAILABLE */

#ifdef  MCAN2_BASEADDR
        #define MCAN2_AVAILABLE    1U
#else    
        #define MCAN2_AVAILABLE    0U    
#endif /* MCAN2_AVAILABLE */

#ifdef  MCAN3_BASEADDR
        #define MCAN3_AVAILABLE    1U
#else    
        #define MCAN3_AVAILABLE    0U    
#endif /* MCAN3_AVAILABLE */

#ifdef  MCAN4_BASEADDR
        #define MCAN4_AVAILABLE    1U
#else    
        #define MCAN4_AVAILABLE    0U    
#endif /* MCAN4_AVAILABLE */

#ifdef  TTCAN0_BASEADDR
        #define TTCAN0_AVAILABLE    1U
#else    
        #define TTCAN0_AVAILABLE    0U    
#endif /* TTCAN0_BASEADDR */
/*Calculate the controllers number available on this platform*/
#define MCAN_CONTROLLERS_NO    (MCAN1_AVAILABLE + MCAN2_AVAILABLE + MCAN3_AVAILABLE + MCAN4_AVAILABLE + TTCAN0_AVAILABLE)
extern CONST(uint32, CAN_43_MCAN_CONST) MCAN_BASE_ADDRS[MCAN_CONTROLLERS_NO];
/*==================================================================================================
*                                      DEFINES AND MACROS
==================================================================================================*/
#define IPV_MCAN_01_00_01_61                   (0x01000161UL)     /* for XPC574XM platform */
#define IPV_MCAN_00_01_00_03                   (0x00010003UL)     /* for XPC577XM platform */
#define IPV_MCAN_00_00_00_21                   (0x00000021UL)   
/*Work around for BASE */
#ifndef IPV_MCAN
  #define IPV_MCAN      0x00010003UL
#endif

/**
* @brief Define used for Can_ControlerDescriptorType.u8ControllerOffset when controller is not enabled.
*/
#define MCAN_NULL_OFFSET_U8       ((uint8)0xFFU)

/**
* @brief Maximum number of Data Bytes that CAN frame accomidate
*/
#define MCAN_MB_DATABYTES_U8          ((uint8)CAN_43_MCAN_REAL_PAYLOAD_U8)
#define MCAN_MASK_32BITS_U32          ((uint32)0xFFFFFFFFU)
#define MCAN_NOT_MASK_32BITS_U32      ((uint32)0x00000000U)
#define MCAN_MBC_ID_IDE_U32           ((uint32)0x80000000U)
#define MCAN_TX_MB_MAX_U32            ((uint32)32U)

/**
* @brief Offset of the Standard ID in the ID reg of MB.
*/
#define MCAN_STANDARD_ID_SHIFT_U32 ((uint32)18U)

#if ((IPV_MCAN) == (IPV_MCAN_01_00_01_61))
#define MCAN_SRAM_SIZE            ((uint32)0x00003E00U)
#endif

#if ((IPV_MCAN) == (IPV_MCAN_00_01_00_03))
#define MCAN_SRAM_SIZE            ((uint32)0x00005000U)
#endif

