KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/MCan/Inc/Reg_eSys_MCan.h
#if ((IPV_MCAN) == (IPV_MCAN_00_00_00_21))
#define MCAN_SRAM_SIZE            ((uint32)0x00004000U)
#endif
/* start address share ram CAN */

#define IPV_MCAN_START_ADDRESS_OFFSET_SHARE_RAM_U32    0U

#define IPV_MCAN_END_ADDRESS_OFFSET_SHARE_RAM_U32      0x3FFFU

#define IPV_MCAN_END_ADDRESS_OFFSET_USEABLE_SHARE_RAM_U32      0x4FFFU

/* Area memory M_TTCAN */

#define IPV_MCAN_START_ADDRESS_OFFSET_TTCAN_U32    0x2D00U

#define IPV_MCAN_END_ADDRESS_OFFSET_TTCAN_U32      0x2EFFU

#ifdef IPV_MCAN
#if ((IPV_MCAN == IPV_MCAN_00_01_00_03) || (IPV_MCAN == IPV_MCAN_01_00_01_61))
/**
* @brief CME bit8: Enable FD
*/
#define MCAN_CCCR_CME_FDN_U32   ((uint32)0x100U)
/**
* @brief FDRATE bit9: Enable values bit rate switch
*/
#define MCAN_CCCR_CME_BRS_U32   ((uint32)0x200U)
#define MCAN_CCCR_CMR_BRS_U32   ((uint32)0x00000800U)
#define MCAN_CCCR_CMR_NOT_BRS_U32   ((uint32)0x00000400U)
#define MCAN_CCCR_CMR_FSTD_U32  ((uint32)0x00000C00U)
#define MCAN_CCCR_FDO_CONFIGURATION ((uint32)0x1000U)
#endif

#if(IPV_MCAN == IPV_MCAN_00_00_00_21)
/**
* @brief FDOE bit8: Enable FD
*/
#define MCAN_CCCR_FDOE_U32   ((uint32)0x100U)
/**
* @brief BRSE bit9: Enable values bit rate switch
*/
#define MCAN_CCCR_BRSE_U32   ((uint32)0x200U)
#endif
#endif

#if (IPV_MCAN_00_00_00_21 == IPV_MCAN_00_00_00_21)  
#define CAN_8_BYTES_PAYLOAD CAN_43_MCAN_8_BYTES_PAYLOAD
#define CAN_12_BYTES_PAYLOAD CAN_43_MCAN_12_BYTES_PAYLOAD
#define CAN_16_BYTES_PAYLOAD CAN_43_MCAN_16_BYTES_PAYLOAD
#define CAN_20_BYTES_PAYLOAD CAN_43_MCAN_20_BYTES_PAYLOAD
#define CAN_24_BYTES_PAYLOAD CAN_43_MCAN_24_BYTES_PAYLOAD
#define CAN_32_BYTES_PAYLOAD CAN_43_MCAN_32_BYTES_PAYLOAD
#define CAN_48_BYTES_PAYLOAD CAN_43_MCAN_48_BYTES_PAYLOAD
#define CAN_64_BYTES_PAYLOAD CAN_43_MCAN_64_BYTES_PAYLOAD
#endif

/* The MB data lengths */
#define MCAN_8_BYTES_U8               ((uint8)0x08U)
#define MCAN_12_BYTES_U8              ((uint8)0x0CU)
#define MCAN_16_BYTES_U8              ((uint8)0x10U)
#define MCAN_20_BYTES_U8              ((uint8)0x14U)
#define MCAN_24_BYTES_U8              ((uint8)0x18U)
#define MCAN_32_BYTES_U8              ((uint8)0x20U)
#define MCAN_48_BYTES_U8              ((uint8)0x30U)
#define MCAN_64_BYTES_U8              ((uint8)0x40U)

/* Offset of the data length code bits for RX and TX element */
#define MCAN_MB_DLC_SHIFT_U32         ((uint32)16U)

/* Define for configuration the data field size for Rx buffer/FIFO element */
#define MCAN_RXESC_8_BYTES_DATA_SIZE_U32            ((uint32)0x000U)
#define MCAN_RXESC_12_BYTES_DATA_SIZE_U32          ((uint32)0x111U)
#define MCAN_RXESC_16_BYTES_DATA_SIZE_U32          ((uint32)0x222U)
#define MCAN_RXESC_20_BYTES_DATA_SIZE_U32          ((uint32)0x333U)
#define MCAN_RXESC_24_BYTES_DATA_SIZE_U32          ((uint32)0x444U)
#define MCAN_RXESC_32_BYTES_DATA_SIZE_U32          ((uint32)0x555U)
#define MCAN_RXESC_48_BYTES_DATA_SIZE_U32          ((uint32)0x666U)
#define MCAN_RXESC_64_BYTES_DATA_SIZE_U32          ((uint32)0x777U)

/* Define for configuration the data field size for Tx buffer element*/
#define MCAN_TXESC_8_BYTES_DATA_SIZE_U32            ((uint32)0x00U)
#define MCAN_TXESC_12_BYTES_DATA_SIZE_U32          ((uint32)0x01U)
#define MCAN_TXESC_16_BYTES_DATA_SIZE_U32          ((uint32)0x02U)
#define MCAN_TXESC_20_BYTES_DATA_SIZE_U32          ((uint32)0x03U)
#define MCAN_TXESC_24_BYTES_DATA_SIZE_U32          ((uint32)0x04U)
#define MCAN_TXESC_32_BYTES_DATA_SIZE_U32          ((uint32)0x05U)
#define MCAN_TXESC_48_BYTES_DATA_SIZE_U32          ((uint32)0x06U)
#define MCAN_TXESC_64_BYTES_DATA_SIZE_U32          ((uint32)0x07U)

#ifdef CAN_43_MCAN_EXTENDEDID
    #if (CAN_43_MCAN_EXTENDEDID == STD_ON)
        #define CAN_43_MCAN_FD_ID_DESCRIPTOR                ((uint32)0x40000000U)
    #else /* (CAN_43_MCAN_EXTENDEDID == STD_OFF) */
        #define CAN_43_MCAN_FD_ID_DESCRIPTOR                ((uint16)0x4000U)
    #endif /* (CAN_43_MCAN_EXTENDEDID == STD_ON/STD_OFF) */
#endif 

#define CAN_43_MCAN_DBTP_TDC_MASK_U32  ((uint32) 0x00800000U)

/*Offset bits for FD register*/
#define MCAN_FD_OFFSET_U8               ((uint8)8U)
/* #define MCAN_FD_BRS_OFFSET              ((uint8)9U) */
#define MCAN_FD_PRESDIV_OFFSET          ((uint8)16U) 
#define MCAN_FD_PSEG1_OFFSET            ((uint8)8U)
#define MCAN_FD_PSEG2_OFFSET            ((uint8)4U)
#define MCAN_FD_SJW_OFFSET              ((uint8)0U)
#define MCAN_FD_BRS_OFFSET              ((uint8)9U)


/*==================================================================================================
                BIT OFFSETS FOR BTP REGISTER
==================================================================================================*/
#ifdef IPV_MCAN
#if ((IPV_MCAN == IPV_MCAN_00_01_00_03) || (IPV_MCAN == IPV_MCAN_01_00_01_61))
        #define MCAN_BTP_SJW_SHIFT       ((uint32)0U)
        #define MCAN_BTP_TSEG2_SHIFT     ((uint32)4U)
        #define MCAN_BTP_TSEG1_SHIFT     ((uint32)8U)
        #define MCAN_BTP_BRP_SHIFT       ((uint32)16U)
#endif
#if (IPV_MCAN == IPV_MCAN_00_00_00_21)
        #define MCAN_BTP_SJW_SHIFT       ((uint32)25U)
        #define MCAN_BTP_TSEG2_SHIFT     ((uint32)0U)
        #define MCAN_BTP_TSEG1_SHIFT     ((uint32)8U)
        #define MCAN_BTP_BRP_SHIFT       ((uint32)16U)
#endif
#endif
/*==================================================================================================
                CAN CONTOLLER CONFIGURATION MASKS
==================================================================================================*/
#define CAN_43_MCAN_CONTROLLERCONFIG_CCCR_ASM_EN_U32        ((uint32)0x00000001U)
#define CAN_43_MCAN_CONTROLLERCONFIG_CCCR_MON_EN_U32        ((uint32)0x00000002U)
#define CAN_43_MCAN_CONTROLLERCONFIG_CCCR_TEST_EN_U32       ((uint32)0x00000004U)
#define CAN_43_MCAN_CONTROLLERCONFIG_ERR_EN_U32             ((uint32)0x00004000U)
#define CAN_43_MCAN_CTLR_CONFIG_ILE_INTL0_EN_U32            ((uint32)0x00000040U)
#define CAN_43_MCAN_CTLR_CONFIG_ILE_INTL1_EN_U32            ((uint32)0x00000080U)
#define CAN_43_MCAN_CONTROLLERCONFIG_RXPOL_EN_U32           ((uint32)0x00000400U)
#define CAN_43_MCAN_CONTROLLERCONFIG_TXPOL_EN_U32           ((uint32)0x00000800U)
#define CAN_43_MCAN_CONTROLLERCONFIG_BOPOL_EN_U32           ((uint32)0x00001000U)
#define CAN_43_MCAN_CONTROLLERCONFIG_MRAFPOL_EN_U32         ((uint32)0x00002000U)


/*==================================================================================================
                              MCAN Register address calculation Macros
==================================================================================================*/
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define CAN_43_MCAN_GET_BASE_ADDRESS(offset) ((uint32)( MCAN_BASE_ADDRS[(offset)] ))

