KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/MCan/Inc/Reg_eSys_MCan.h
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_CREL(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_ENDN(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x04U ) )
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_FBTP(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x0CU ) )

#ifdef IPV_MCAN
#if (IPV_MCAN == IPV_MCAN_00_00_00_21)
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_DBTP(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x0CU ) )
#endif
#endif
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TEST(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x10U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RWD(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x14U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_CCCR(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x18U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_BTP(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x1CU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TSCC(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x20U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TSCV(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x24U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TOCC(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x28U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TOCV(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x2CU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_ECR(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x40U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_PSR(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x44U ) )

#ifdef IPV_MCAN
#if (IPV_MCAN == IPV_MCAN_00_00_00_21)
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TDCR(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x48U ) )
#endif
#endif
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_IR(offset)           ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x50U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_IE(offset)           ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x54U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_ILS(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x58U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_ILE(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x5CU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_GFC(offset)          ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x80U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_SIDFC(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x84U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_XIDFC(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x88U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_XIDAM(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x90U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_HPMS(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x94U ) )
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_NDAT1(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x98U ) )
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_NDAT2(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0x9CU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXF0C(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xA0U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXF0S(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xA4U ) )

