KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/MCan/Inc/Reg_eSys_MCan.h
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXF0A(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xA8U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXBC(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xACU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXF1C(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xB0U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXF1S(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xB4U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXF1A(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xB8U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_RXESC(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xBCU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXESC(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xC8U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBC(offset)         ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xC0U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXFQS(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xC4U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBRP(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xCCU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBAR(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xD0U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBCR(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xD4U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBTO(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xD8U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBCF(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xDCU ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBTIE(offset)       ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xE0U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXBCIE(offset)       ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xE4U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXEFC(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xF0U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXEFS(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xF4U ) )

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_TXEFA(offset)        ( (uint32)( CAN_43_MCAN_GET_BASE_ADDRESS(offset) + 0xF8U ) )



/*==================================================================================================
               MCAN REGISTER AND BIT ACCESS MACROS
==================================================================================================*/
#ifdef IPV_MCAN
#if ((IPV_MCAN == IPV_MCAN_00_01_00_03) || (IPV_MCAN == IPV_MCAN_01_00_01_61))
#define MCAN_CCCR_MASK_U32  ((uint32)0x00004FF7U)
#endif
#if (IPV_MCAN == IPV_MCAN_00_00_00_21)
#define MCAN_CCCR_MASK_U32  ((uint32)0x0000F3F7U)
#endif
#endif

#ifdef IPV_MCAN
#if ((IPV_MCAN == IPV_MCAN_00_01_00_03) || (IPV_MCAN == IPV_MCAN_01_00_01_61))
#define MCAN_BTP_MASK_U32   ((uint32)0x03FF3FFFU)
#endif
#if (IPV_MCAN == IPV_MCAN_00_00_00_21)
#define MCAN_BTP_MASK_U32   ((uint32)0xFFFFFF7FU)
#endif
#endif

#define MCAN_GFC_MASK_U32   ((uint32)0x0000003FU)
#define MCAN_SIDFC_MASK_U32 ((uint32)0x00FFFFFCU)
#define MCAN_XIDFC_MASK_U32 ((uint32)0x007FFFFCU)
#define MCAN_XIDAM_MASK_U32 ((uint32)0x1FFFFFFFU)
/* Note: The F0WM field in the has 7 bits*/
#define MCAN_RXF0C_MASK_U32 ((uint32)0x7F7FFFFCU)
#define MCAN_RXF0A_MASK_U32 ((uint32)0x0000003FU)
#define MCAN_RXF1C_MASK_U32 ((uint32)0x7F7FFFFCU)
#define MCAN_RXF1A_MASK_U32 ((uint32)0x0000003FU)
#define MCAN_RXESC_MASK_U32 ((uint32)0x0000777FU)
#define MCAN_TXESC_MASK_U32 ((uint32)0x0000007FU)
#define MCAN_TXBC_MASK_U32  ((uint32)0x7F3FFFFCU)
#define MCAN_ILE_MASK_U32   ((uint32)0x00000003U)

#ifdef IPV_MCAN
#if ((IPV_MCAN == IPV_MCAN_00_01_00_03) || (IPV_MCAN == IPV_MCAN_01_00_01_61))
#define MCAN_FBTP_MASK_U32  ((uint32)0x001F0F73U)
#endif
#if(IPV_MCAN == IPV_MCAN_00_00_00_21)
#define MCAN_FBTP_MASK_U32  ((uint32)0x009F1FFFU)
#endif
#endif

#ifdef IPV_MCAN
#if ((IPV_MCAN == IPV_MCAN_00_01_00_03) || (IPV_MCAN == IPV_MCAN_01_00_01_61))
#define MCAN_FBTP_TDCO_MASK_U32  ((uint32)0x1F000000U)
#endif
#if(IPV_MCAN == IPV_MCAN_00_00_00_21)
#define MCAN_TDCR_TDCO_MASK_U32  ((uint32)0x00007F00U)
#endif
#endif
/*==================================================================================================
                BIT MASKS FOR TEST REGISTER: TEST (Base+0x0010)
==================================================================================================*/

#define MCAN_TEST_LBCK_U32      ((uint32)0x00000010U)

/*==================================================================================================
                BIT MASKS FOR CC CONTROL REGISTER: CCCR (Base+0x0018)
==================================================================================================*/

#define MCAN_CCCR_INIT_U32      ((uint32)0x00000001U)
#define MCAN_CCCR_CCE_U32       ((uint32)0x00000002U)
#define MCAN_CCCR_ASM_U32       ((uint32)0x00000004U)
#define MCAN_CCCR_CSA_U32       ((uint32)0x00000008U)
#define MCAN_CCCR_CSR_U32       ((uint32)0x00000010U)
#define MCAN_CCCR_MON_U32       ((uint32)0x00000020U)
#define MCAN_CCCR_DAR_U32       ((uint32)0x00000040U)
#define MCAN_CCCR_TEST_U32      ((uint32)0x00000080U)


/*==================================================================================================
                BIT MASKS FOR BIT TIMING AND PRESCALAR REGISTER: BTP (Base+0x001C)
==================================================================================================*/

