KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/MCan/Inc/Reg_eSys_MCan.h
#ifdef IPV_MCAN
   
        #define MCAN_BTP_SJW_U32       ((uint32)0xFE000000U)
        #define MCAN_BTP_TSEG2_U32     ((uint32)0x0000007FU)
        #define MCAN_BTP_TSEG1_U32     ((uint32)0x0000FF00U)
        #define MCAN_BTP_BRP_U32       ((uint32)0x01FF0000U)
 
#endif

/*==================================================================================================
                BIT MASKS FOR ERROR COUNTER REGISTER: ECR (Base+0x0040)
==================================================================================================*/

#define MCAN_ECR_TEC_U32      ((uint32)0x000000FFU)
#define MCAN_ECR_REC_U32      ((uint32)0x00007F00U)
#define MCAN_ECR_RP_U32       ((uint32)0x00008000U)
#define MCAN_ECR_CEL_U32      ((uint32)0x00FF0000U)

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_ECR_READ(offset)                (REG_READ32( MCAN_ECR(offset)))

/*==================================================================================================
                BIT MASKS FOR PROTOCOL STATUS REGISTER: PSR (Base+0x0044)
==================================================================================================*/


#define MCAN_PSR_LEC_U32      ((uint32)0x00000007U)
#define MCAN_PSR_ACT_U32      ((uint32)0x00000018U)
#define MCAN_PSR_EP_U32       ((uint32)0x00000020U)
#define MCAN_PSR_EW_U32       ((uint32)0x00000040U)
#define MCAN_PSR_BO_U32       ((uint32)0x00000080U)


/*==================================================================================================
         BIT MASKS FOR INTERRUPT REGISTER,             : IR  (Base+0x0050)
         BIT MASKS FOR INTERRUPT ENABLE REGISTER,      : IE  (Base+0x0054)
         BIT MASKS FOR INTERRUPT LINE SELECT REGISTER, : ILS (Base+0x0058)
         BIT MASKS FOR INTERRUPT LINE ENABLE REGISTER, : ILE (Base+0x005C)
==================================================================================================*/
#define MCAN_INTERRUPT_RF0N_U32      ((uint32)0x00000001U)
#define MCAN_INTERRUPT_RF0W_U32      ((uint32)0x00000002U)
#define MCAN_INTERRUPT_RF0F_U32      ((uint32)0x00000004U)
#define MCAN_INTERRUPT_RF0L_U32      ((uint32)0x00000008U)
#define MCAN_INTERRUPT_RF1N_U32      ((uint32)0x00000010U)
#define MCAN_INTERRUPT_RF1W_U32      ((uint32)0x00000020U)
#define MCAN_INTERRUPT_RF1F_U32      ((uint32)0x00000040U)
#define MCAN_INTERRUPT_RF1L_U32      ((uint32)0x00000080U)
#define MCAN_INTERRUPT_HPM_U32       ((uint32)0x00000100U)
#define MCAN_INTERRUPT_TC_U32        ((uint32)0x00000200U)
#define MCAN_INTERRUPT_TCF_U32       ((uint32)0x00000400U)
#define MCAN_INTERRUPT_TFE_U32       ((uint32)0x00000800U)
#define MCAN_INTERRUPT_TEFN_U32      ((uint32)0x00001000U)
#define MCAN_INTERRUPT_TEFW_U32      ((uint32)0x00002000U)
#define MCAN_INTERRUPT_TEFF_U32      ((uint32)0x00004000U)
#define MCAN_INTERRUPT_TEFL_U32      ((uint32)0x00008000U)
#define MCAN_INTERRUPT_TSW_U32       ((uint32)0x00010000U)
#define MCAN_INTERRUPT_MRAF_U32       ((uint32)0x00020000U)
#define MCAN_INTERRUPT_TOO_U32       ((uint32)0x00040000U)
#define MCAN_INTERRUPT_DRX_U32       ((uint32)0x00080000U)
#define MCAN_INTERRUPT_BEC_U32       ((uint32)0x00100000U)
#define MCAN_INTERRUPT_BEU_U32       ((uint32)0x00200000U)
#define MCAN_INTERRUPT_ELO_U32       ((uint32)0x00400000U)
#define MCAN_INTERRUPT_EP_U32        ((uint32)0x00800000U)
#define MCAN_INTERRUPT_EW_U32        ((uint32)0x01000000U)
#define MCAN_INTERRUPT_BO_U32        ((uint32)0x02000000U)
#define MCAN_INTERRUPT_WDI_U32       ((uint32)0x04000000U)

#ifdef IPV_MCAN
#if ((IPV_MCAN == IPV_MCAN_00_01_00_03) || (IPV_MCAN == IPV_MCAN_01_00_01_61))
#define MCAN_INTERRUPT_CRCE_U32      ((uint32)0x08000000U)
#define MCAN_INTERRUPT_BE_U32        ((uint32)0x10000000U)
#define MCAN_INTERRUPT_ACKE_U32      ((uint32)0x20000000U)
#define MCAN_INTERRUPT_FOE_U32       ((uint32)0x40000000U)
#define MCAN_INTERRUPT_STE_U32       ((uint32)0x80000000U)
#define MCAN_ERR_INTERRUPT_U32       ((uint32)0xF0000000U)
#endif
#if (IPV_MCAN == IPV_MCAN_00_00_00_21)
#define MCAN_INTERRUPT_FEA_U32       ((uint32)0x08000000U)
#define MCAN_INTERRUPT_FED_U32       ((uint32)0x10000000U)
#define MCAN_INTERRUPT_ARA_U32       ((uint32)0x20000000U)
#define MCAN_ERR_INTERRUPT_U32       ((uint32)0x38000000U)
#define MCAN_INTERRUPT_MASK_U32      ((uint32)0x3FFFFFFFU)
#endif
#endif


/*==================================================================================================
         BIT MASKS FOR INTERRUPT LINE ENABLE REGISTER, : ILE (Base+0x005C)
==================================================================================================*/

#define MCAN_ILE_EINT0_U32      ((uint32)0x00000001U)
#define MCAN_ILE_EINT1_U32      ((uint32)0x00000002U)


/*==================================================================================================
         BIT MASKS FOR GLOBAL FILTER CONFIGURATION REGISTER, : GFC (Base+0x0080)
==================================================================================================*/

#define MCAN_GFC_RRFE_U32      ((uint32)0x00000001U)
#define MCAN_GFC_RRFS_U32      ((uint32)0x00000002U)
#define MCAN_GFC_ANFE_U32      ((uint32)0x0000000CU)
#define MCAN_GFC_ANFS_U32      ((uint32)0x00000030U)

/*==================================================================================================
         BIT MASKS FOR STANDARD ID FILTER CONFIGURATION REGISTER, : SIDFC (Base+0x0084)
==================================================================================================*/

#define MCAN_SIDFC_FLSSA_SHIFT_U32      ((uint32)2U)
#define MCAN_SIDFC_LSS_SHIFT_U32        ((uint32)16U)



/*==================================================================================================
         BIT MASKS FOR STANDARD ID EXTENDED CONFIGURATION REGISTER, : XIDFC (Base+0x0088)
==================================================================================================*/

