KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/MCan/Inc/Reg_eSys_MCan.h
#define MCAN_XIDFC_FLESA_SHIFT_U32      ((uint32)2U)
#define MCAN_XIDFC_LSE_SHIFT_U32        ((uint32)16U)



/*==================================================================================================
         BIT MASKS FOR EXTENDED ID AND MASK REGISTER, : XIDAM (Base+0x0090)
==================================================================================================*/

#define MCAN_XIDAM_EIDM_U32        ((uint32)0x1FFFFFFFU)



/*==================================================================================================
         BIT MASKS FOR HIGH PRIORITY MESSAGE STATUS REGISTER, : HPMS (Base+0x0094)
==================================================================================================*/

#define MCAN_HPMS_BIDX_U32        ((uint32)0x0000003FU)
#define MCAN_HPMS_MSI_U32         ((uint32)0x000000C0U)
#define MCAN_HPMS_FIDX_U32        ((uint32)0x00007F00U)
#define MCAN_HPMS_FLST_U32        ((uint32)0x00008000U)


/*==================================================================================================
         BIT MASKS FOR Rx FIFO 0 CONFIGURATION REGISTER, : RXF0C (Base+0x00A0)
         BIT MASKS FOR Rx FIFO 1 CONFIGURATION REGISTER, : RXF1C (Base+0x00B0)
==================================================================================================*/

#define MCAN_RXF0C_F0SA_SHIFT_U32    ((uint32)2U)
#define MCAN_RXF0C_F0S_SHIFT_U32     ((uint32)16U)
#define MCAN_RXF0C_F0WM_SHIFT_U32    ((uint32)24U)
#define MCAN_RXF0C_F0WM_MASK_U32     ((uint32)0x7F000000U)
#define MCAN_RXF1C_F1SA_SHIFT_U32    ((uint32)2U)
#define MCAN_RXF1C_F1S_SHIFT_U32     ((uint32)16U)
#define MCAN_RXF1C_F1WM_SHIFT_U32    ((uint32)24U)
#define MCAN_RXF1C_F1WM_MASK_U32     ((uint32)0x7F000000U)

/*==================================================================================================
         BIT MASKS FOR Rx FIFO 0 ACKNOWLEDGE REGISTER, : RXF0A (Base+0x00A8)
==================================================================================================*/

#define MCAN_RXF0A_F0AI_U32       ((uint32)0x0000003FU)



/*==================================================================================================
         BIT MASKS FOR Rx FIFO 0 STATUS REGISTER, : RXF0S (Base+0x00A4)
==================================================================================================*/

#define MCAN_RXF0S_F0FL_U32        ((uint32)0x0000007FU)
#define MCAN_RXF0S_F0GI_U32        ((uint32)0x00003F00U)
#define MCAN_RXF0S_F0GI_SHIFT_U32  ((uint32)8U)
#define MCAN_RXF0S_F0F_U32         ((uint32)0x01000000U)
#define MCAN_RXF0S_RF0L_U32        ((uint32)0x02000000U)





/*==================================================================================================
         BIT MASKS FOR Rx FIFO 1 STATUS REGISTER, : RXF1S (Base+0x00B4)
==================================================================================================*/

#define MCAN_RXF1S_F1FL_U32        ((uint32)0x0000007FU)
#define MCAN_RXF1S_F1GI_U32        ((uint32)0x00003F00U)
#define MCAN_RXF1S_F1GI_SHIFT_U32  ((uint32)8U)
#define MCAN_RXF1S_F1F_U32         ((uint32)0x01000000U)
#define MCAN_RXF1S_RF1L_U32        ((uint32)0x02000000U)
#define MCAN_RXF1S_DMS_U32         ((uint32)0xC0000000U)





/*==================================================================================================
         BIT MASKS FOR Rx FIFO 1 ACKNOWLEDGE REGISTER, : RXF1A (Base+0x00B8)
==================================================================================================*/

#define MCAN_RXF1A_F1AI_U32       ((uint32)0x0000003FU)

/*==================================================================================================
         BIT MASKS FOR Rx BUFFER CONFIGURATION REGISTER, : RXBC (Base+0x00AC)
==================================================================================================*/

#define MCAN_RXBC_RBSA_SHIFT_U32     ((uint32)2U)

/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXBC (Base+0x00B8)
==================================================================================================*/

#define MCAN_TXBC_TBSA_SHIFT_U32     ((uint32)2U)
#define MCAN_TXBC_NDTB_SHIFT_U32     ((uint32)16U)

/*==================================================================================================
         BIT MASKS FOR RXESC REGISTER
==================================================================================================*/
#define MCAN_RXESC_RBDS_MASK_U32     ((uint32)0x00000700U)  
#define MCAN_RXESC_RBDS_SHIFT_U32    ((uint32)8U)  
#define MCAN_RXESC_F0DS_MASK_U32     ((uint32)0x00000007U)  
#define MCAN_RXESC_F0DS_SHIFT_U32    ((uint32)0U)  
#define MCAN_RXESC_F1DS_MASK_U32     ((uint32)0x00000070U) 
#define MCAN_RXESC_F1DS_SHIFT_U32    ((uint32)4U)  
/*==================================================================================================
         BIT MASKS FOR TXESC REGISTER
==================================================================================================*/
#define MCAN_TXESC_TBDS_SHIFT_U32  ((uint32)0U)



/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXFQS
==================================================================================================*/



/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXBAR
==================================================================================================*/




/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXBCR
==================================================================================================*/





/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXBTIE
==================================================================================================*/



/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXBCIE
==================================================================================================*/



/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXBTO
==================================================================================================*/


/*==================================================================================================
         BIT MASKS FOR Tx BUFFER CONFIGURATION REGISTER, : TXBCF
==================================================================================================*/
/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define MCAN_MB_TXBCF_READ(offset,mbindex)   ((uint32)(REG_READ32( MCAN_TXBCF(offset)) & (uint32)((uint32)(1U) << (uint32)(mbindex))) )

/*==================================================================================================
         SRAM
==================================================================================================*/
#define MCAN_MB_TYPE_XTD_U32            0x40000000U
#define MCAN_MB_TYPE_STD_U32            0x1FFC0000U
#define MCAN_MB_RTR_MASK_U32           0x20000000U

