KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/MCan/Inc/Reg_eSys_MCan.h
#define MCAN_TX_MB_ID_MASK_U32         0x1FFFFFFFU
#define MCAN_TX_MB_XTD_MASK_U32        0x40000000U
#define MCAN_TX_MB_DLC_MASK_U32        0x000F0000U
#define MCAN_TX_MB_DLC_FD_MASK_U32     0x003F0000U
#define MCAN_TX_MB_DLC_SHIFT_U32       ((uint32)16U)
#define MCAN_FD_WITH_BITRATE_SWITCHING_U32      (0x00300000U)
#define MCAN_FD_WITHOUT_BITRATE_SWITCHING_U32   (0x00200000U)
#define MCAN_CLASSIC_U32                        (0x00000000U)

#define MCAN_RX_MB_FIDX_MASK_U32       0x7F000000U
#define MCAN_RX_MB_ANMF_MASK_U32       0x80000000U
#define MCAN_RX_MB_ID_MASK_U32         0x1FFFFFFFU
#define MCAN_RX_MB_XTD_MASK_U32        0x40000000U
#define MCAN_RX_MB_DLC_MASK_U32        0x000F0000U
#define MCAN_RX_MB_DLC_SHIFT_U32       ((uint32)16U)

#define MCAN_WARNING_MASK_U32          0x00000040U
#define MCAN_EDL_MASK_U32              0x00200000U

#define MCAN_RANGE_FILTER_U8         0x00U
#define MCAN_DUAL_ID_FILTER_U8       0x01U
#define MCAN_CLASSIC_FILTER_U8       0x02U

#define MCAN_STORE_RX_FIFO0_U8       0xFCU
#define MCAN_STORE_RX_FIFO1_U8       0xFDU
#define MCAN_STORE_TX_BUFFER_U8      0xFFU

/*==================================================================================================
         STANDARD MESSAGE ID FILTER ELEMENT
==================================================================================================*/

#define MCAN_SRAM_STD_FTR_LENGTH_U32    ((uint32)4U)
#define MCAN_SRAM_EXD_FTR_LENGTH_U32    ((uint32)8U)

/*==================================================================================================
         EXTENDED MESSAGE ID FILTER ELEMENT
==================================================================================================*/

/*
* @violates @ref Reg_eSys_MCan_h_REF_1 Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/

#define MCAN_SRAM_SMIDFE_SFID2_MASK_U32      0x000007FFU
#define MCAN_SRAM_SMIDFE_SFID1_MASK_U32      0x07ff0000U
#define MCAN_SRAM_SMIDFE_SFID1_SHIFT_U32    ((uint32)16U)
#define MCAN_SRAM_SMIDFE_SFEC_MASK_U32       0x38000000U
#define MCAN_SRAM_SMIDFE_SFEC_SHIFT_U32     ((uint32)27U)
#define MCAN_SRAM_SMIDFE_SFT_MASK_U32        0xC0000000U
#define MCAN_SRAM_SMIDFE_SFT_SHIFT_U32      ((uint32)30U)
#define MCAN_SRAM_EMIDFE_EFID_MASK_U32       0x1FFFFFFFU
#define MCAN_SRAM_EMIDFE_EFEC_MASK_U32       0xE0000000U
#define MCAN_SRAM_EMIDFE_EFEC_SHIFT_U32     ((uint32)29U)
#define MCAN_SRAM_EMIDFE_EFT_SHIFT_U32      ((uint32)30U)
#define MCAN_SRAM_EMIDFE_EFT_MASK_U32        0xC0000000U
#define MCAN_RXFIFO0_OVFL_MASK_U32           0x0000000CU
#define MCAN_RXFIFO1_OVFL_MASK_U32           0x000000C0U



/*==================================================================================================
*                                          TX MESSAGE BUFFERS
==================================================================================================*/




/*==================================================================================================
*                                          RECEIVE FIFO 0
==================================================================================================*/



/*==================================================================================================
*                                          RECEIVE FIFO 1
==================================================================================================*/



/*==================================================================================================
*                                          RECEIVE Rx BUFFER
==================================================================================================*/



/*==================================================================================================
*                                             ENUMS
==================================================================================================*/

/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/
#define CAN_43_MCAN_START_SEC_CONST_UNSPECIFIED
/* @violates @ref Reg_eSys_MCan_h_REF_4 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h */

#include "MemMap.h"

#define CAN_43_MCAN_STOP_SEC_CONST_UNSPECIFIED
/*
* @violates @ref Reg_eSys_MCan_h_REF_4 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/

#include "MemMap.h"


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

#if (CAN_43_MCAN_PRECOMPILE_SUPPORT == STD_OFF)
#define CAN_43_MCAN_START_SEC_CONFIG_DATA_UNSPECIFIED
/*
* @violates @ref Reg_eSys_MCan_h_REF_4 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "MemMap.h"

#define CAN_43_MCAN_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/*
* @violates @ref Reg_eSys_MCan_h_REF_4 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "MemMap.h"
#endif

/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/
#define CAN_43_MCAN_START_SEC_CODE
/*
* @violates @ref Reg_eSys_MCan_h_REF_4 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "MemMap.h"

#define CAN_43_MCAN_STOP_SEC_CODE
/*
* @violates @ref Reg_eSys_MCan_h_REF_4 Violates MISRA 2004 Required Rule 19.15, Repeated include file MemMap.h
*/
#include "MemMap.h"

#ifdef __cplusplus
}
#endif

#endif /*TEMPLATE_H*/

/** @} */
